Proba/Statistics and Data anaysis/estadistica.org
#+title: Notas de Estadistica
#+author: Carlos Eduardo artínez Aguilar
#+OPTIONS: tex:t
#+LANGUAGE: esp
#+SETUPFILE: ~/Templates/latex-export.org
