Proba/Statistics and Data anaysis/estadistica.org
** Medida y probabilidad.

\begin{def.}
Una /sigma-álgebra/ sobre un conjunto $\Omega$ es una colección de subconjuntos de $\Omega$, la cual denotamos por $\Sigma$ y cumple lo siguiente
+ $\emptyset\in\Sigma$ y $\Omega\in\Sigma$
+ $A\in\Sigma$ implica $\Omega\setminus A\in\Sigma$
+ $\{A_n\}_{n\in\nat}\subset\Sigma$ entonces $\bigcup_{n\in\nat} A_n\in\Sigma$
A los elementos de $\Sigma$ se les llama como /conjuntos medibles/ o para la probabilidad /eventos/ y al par $(\Omega,\Sigma)$ se le llama un espacio medible.
\end{def.}

\eje Se define a la $\sigma$ álgebra generada por $\mathrm{F}$ como la $\sigma$ álgebra más chica que contiene a $\mathrm{F}$, esto es equivalente a la intersección de todas las $\sigma$ álgebras que contienen a $\mathrm{F}$ y se denotará por $\sigma(\mathrm{F})$.

\eje Un ejemplo típico de espacio medible es el comjunto de números reales $\Omega=\re$ y la sigma álgebra generado por los intervalos abiertos, también conocida como la sigma-álgebra de Borel (en escencia son conjuntos complicados del tipo $F_{\sigma}$ y $G_{\delta}$).

\obs Dado un conjunto $\Omega$ y una sigma álgebra $\Sigma$ y $U\subset\Omega$ siempre existe la sub-sigma-álgebra
\[
    \Sigma(U)=\{U\cap E\,|\,E\in\Sigma\}
\]

\begin{def.}
\noindent Entenderemos un /espacio de probabilidad/ como un espacio de medida $(\Omega,\Sigma,\textbf{P})$ con medida uno, es decir un conjunto con una /sigma-álgebra/ $\Sigma$ y una medida *P*, tal que sea una medida de probabilidad, es decir que cumple:

+ $\textbf{P}(A)\geq 0$
+ $\textbf{P}(\Omega)=1$
+ Si $\{A_n\}\subset\Sigma$ es tal que $A_n\cap A_{n+1}=\emptyset$, entonces $\textbf{P}(\bigcup A_n)=\sum_{n=1}^{\infty} \textbf{P}(A_n)$
\end{def.}

Se le denomina a los conjuntos medibles de un espacio de probabilidad como /eventos/ y a dicha medida le llamamos /medida de probabilidad/, así mismo se le denomina al espacio total $X$ como /espacio de muestras/. Así la medida de probabilidad *P* evaluada en un evento $E$, $\textbf{P}(E)$ es naturalmente la probabilidad del evento $E$ y a un evento de probabilidad cero se le conoce como /evento nulo/. Si un evento tiene como complemento un evento nulo, en otra palabras, si el evento tiene probabilidad 1 diremos que el evento es /casi seguro/.

\eje El ejemplo prototípico son los intervalos finitos de números reales cuya sigma álgebra es el álgebra de los conjuntos /borelianos/ o los /medibles de lebesgue/ y la medida de Lebesgue reescalada para medir exactamente 1 $P([a,b])=1/(b-a)\lambda$, donde $\lambda$ es la medida de lebesque usual.

\eje La forma más simple de definir una probabilidad es mediante una función positiva en un conjunto que se quiera medir, uno de los ejemplos más importantes para la teoría de la probabilidad es /distribución gausiana/ definida en todos los reales:

\[
    f(x)=\frac{1}{\sigma\sqrt{2\pi}}e^{(\frac{x-\mu}{\sigma})^2}\quad \prob(x)=\int_{t\leq x}f(t)dt
\]

\begin{def.}
Dado un espacio de probabilidad $(\om,\sig,\mu)$ y una varible aleatoria no-negativa $X:\om\rightarrow \re$ y de integral finita (no necesareamente continua en el sentido usual), se define la /distribución de probabilidad/ con función de densidad definida por $X$ como
\[
\prob(E)=\int_E Xd\mu
\]
\end{def.}

\begin{def.}
Dado una probabilidad en los reales $(\re,\mathbb{B}_{\re},\prob)$ y una varible aleatoria no-negativa, se define la /función de probabilidad/ relacionada a $\prob$ como
\[
        f(x)=\prob(\{t\,|\,t\leq x\})
\]
\end{def.}
\eje En el caso de la distribución gaussiana, la fuanción de probabilidad fue definida como
\[
    \prob(x)=\int_{t\leq x}\frac{1}{\sigma\sqrt{2\pi}}e^{(\frac{t-\mu}{\sigma})^2}dt =
    \int_{-\infty}^{x}\frac{1}{\sigma\sqrt{2\pi}}e^{(\frac{t-\mu}{\sigma})^2}dt
\]










\obs Dada una sucesión $\{x_n\}_{n\in\nat}$ denotaremos $x_n\downarrow x$ o $x_n\uparrow x$ si $x_{n+1}\leq x_n$ y $x_{n+1}\geq x_n$ $\lim_{n\rightarrow\infty}x_n=x$ respectivamente. Aplicaremos la misma notación para eventos $\{A_n\}_{n\in\nat}\subset\sig$.\\
Existen construcciones conjuntistas que son más útiles en el sentido probabilístico, por ejemplo si $\{A_n\}_{n\in\nat}$ es una sucesión de eventos aletorios definimos los conjuntos $\{A_n\text{ i.o.}\}$ y $\{A_n\text{ ult.}\}$ dónde i.o significa ``infinitely often'' y ult ``ultimately'', éstos términos se refieren a el comportamiento de las colas de la sucesión de los eventos
\begin{align*}
\{A_n\text{ i.o.}\}=\Big\{\sum_{n\in\nat}1_{A_n}=\infty\Big\}=\bigcap_{n\in\nat}\bigcup_{k\geq n}A_k,\\
\{A_n\text{ ult.}\}=\Big\{\sum_{n\in\nat}1_{A_n}<\infty\Big\}=\bigcup_{n\in\nat}\bigcap_{k\geq n}A_k.
\end{align*}
\noindent Notemos que esto se puede expresar en términos de funciones indicadoras como
\[
1_{\{A_n\text{ i.o.}\}}=\limsup_{n\rightarrow\infty}1_{A_n} \hspace{0.3cm} 1_{\{A_n\text{ ult.}\}}=\liminf_{n\rightarrow\infty}1_{A_n}.
\]
\noindent Ahora por la /desigualdad de Fatou/ se cumple lo siguiente con respecto a las probabilidades de estos conjuntos
\[
\prob(1_{\{A_n\text{ i.o.}\}})\geq\limsup_{n\rightarrow\infty}\prob(A_n)\hspace{0.3cm} \prob({\{A_n\text{ ult.}\}})\leq\liminf_{n\rightarrow\infty}\prob(A_n).
\]
\noindent Por la subaditividad y continuidad de la probabilidad se obtiene
\[
 \prob(\{A_n\text{ i.o.}\})=\lim_{n\rightarrow\infty}\prob(\bigcup_{k\geq n} A_k)\leq\lim_{n\rightarrow\infty}\sum_{k\geq n}\prob(A_k).
\]
\obs Si $\sum_{n\in\nat}\prob(A_n)$ entonces las colas tienden a cero y por lo tanto $\prob(\{A_n\text{ i.o.}\})=0$. Esto corresponde a la parte fácil del lema de /Borel-Cantelli/ que veremos en el futuro.

\begin{def.}
Dado un espacio de probabilidad $(\om,\sig,\prob)$, un espacio medible $(E,S)$ y un conjunto arbitrario $T$, el cual llamaremos a partir de ahora como un \emph{índice arbitrario o abstracto}, es posible definir el espacio medible $E^{T}:=\{f:T\rightarrow E\}$ con la sigma álgebra definida por los mapeos de evaluación, definidos para cada $t\in T$ como $\pi_t:E^{T}\rightarrow E$, $\pi_t(f):=f(t)$. Así si $X:\om\rightarrow E^{T}$ es un elemento aleatorio, se define la función $X(t,\omega)=\pi_t\circ X$, donde $X:T\times\om\rightarrow E$, a esta función le llamaremos un \emph{proceso aleatorio}. Si $T$ es de cardinalidad numerable diremos que $X$ es un proceso de tiempo discreto y si $T$ es de cardinalidad mayor a la numerable, diremos que $X$ es de tiempo continuo.
\end{def.}
\obs Un proceso $X:T\times\om\rightarrow E$ es aleatorio (medible) si y solo si para toda $t\in T$, $X_t:\om\rightarrow E$ definida por $X_t(\omega):=X(t,\omega)$ es medible.

