Proba/Statistics and Data anaysis/estadistica.tex

\subsection{Medidas con signo}
\label{sec:org4a52639}

Además de medidas de probabilidad, existen las \emph{medidas con signo} es decir, si \((\Omega,\Sigma)\) es un espacio medible, entonces una función \(\nu:\Sigma\rightarrow\re\) es una medida con signo si cumple

\begin{itemize}
\item \(\nu(\emptyset)=0\).
\item \(\nu\) toma a lo más uno de los valores \(\infty\) o \(-\infty\).
\item Si \(\{A_n\}\subset\Sigma\) es una sucesión de conjuntos disjuntos, entonces \(\nu(\bigcup A_n)=\sum_{n=1}^{\infty} \nu(A_n)\), donde entendemos que para valores finitos la convergencia es absoluta.
\end{itemize}

\eje Un ejemplo que utilizaremos todo el tiempo es la medida con signo definida por una variable aleatoria \(X:\Omega\rightarrow\re\)
\[
    \nu(A)=\int_{A} X d\textbf{P}=\esp(X1_{A}),
\]
en el caso de una variable aleatoria \textbf{positiva}, con esperanza finita (o esperanza 1), le llamaremos \emph{distribución de probabilidad}, pero habrá más información sobre estas probabilidades en una sección futura.
\begin{def.}
Sea \((\om,\sig,\mu)\) un espacio de medida y \(\nu\) una medida con signo, decimos que \(\nu\) es absolutamente continua con respecto a \(\mu\) (denotado \(\nu<<\mu\)) si \(\mu(A)=0\), entonces \(\nu(A)=0\).
\end{def.}
\noindent Una medida con signo \(\nu\), definida por una variable aleatoria \(X\) es absolutamente continua con respecto a la probabilidad \textbf{P}. Para cualquier función medible \(f:\Omega\rightarrow\re\) \textbf{siempre} podemos descomponerla de la siguiente manera \(f=f^{+}-f^{-}\), donde \(f^{\pm}=\pm f 1_{E^{\pm}}\) y \(E^{\pm}=\{x\in\Omega\,\vert\,\pm f >0\}\). De la misma manera una medida con signo definida por \(f\), \(\nu\) se descompone en \(\nu^{\pm}\).

\section{Esperanza}
\label{sec:orge52ec98}
\noindent Asi mismo entenderemos a la \emph{esperanza} de una variable aleatoria como la integral de dicha funcion medible, es decir
\begin{equation}
    \esp(f(z))=
    \begin{cases}
        & \sum_{i} p_i f(z)\\
        & \int_{\Omega}f(z)d\mu
    \end{cases}
\end{equation}
Comunemente se define la probabilidad condicional de un evento \(A\) con respecto a otro evento \(B\) como la siguiente fórmula
\[
    \prob(A|B)=\frac{\prob(A\cap B)}{\prob(B)},
\]
\noindent sinembargo comunmente se utiliza el concepto más general de \emph{esperanza condicional}
\begin{def.}
    Si \((\Omega,\Sigma,\prob)\) es un espacio de probabilidad, \(X:\Omega\rightarrow\re\) es una variable aleatoria inegrable y \(\mathrm{T} \subset\Sigma\) es una sigma sub álgebra, entonces decimos que una funcion \(Y:\Omega\rightarrow\re\) es una \emph{esperanza} condicional si cumple lo siguiente.
\begin{itemize}
\item \(Y\) es \(\mathrm{T}\) medible
\item \(\esp(|Y|)<\infty\)
\item \(\esp(X 1_A)=\esp(Y1_A)\) para todo \(A\in\mathrm{T}\)
\end{itemize}
se denotará a la esperanza condicional de \(X\) con respecto a \(\mathrm{T}\) como \(\esp(X|\mathrm{T})\).
\end{def.}
\noindent\dem Podemos demostrar la existencia de la esperanza condicional por medio del teorema de Radon-Nikodym (1930)
\begin{teorema}[Radon-Nikodym]
    Sea $(\Omega,\Sigma)$ un espacio medible y $\mu:\Omega\rightarrow\re$ una medida ($\sigma$) finita y $\nu$ una medida con signo ($\sigma$) finita tal que $\nu$ sea absolutamente continua con respecto a $\mu$, entonces existe $f:\Omega\rightarrow\re$ funcion medible tal que
\begin{equation}
    \nu(A)=\int_{A} f d\mu \hspace{0.5cm}\forall A\in\Sigma,
\end{equation}
además la función $f$ es única casi donde quiera, a esta función se le conoce como *derivada de Radon-Nikodym* y usualmente se denota
\[
    f=\frac{d\nu}{d\mu}[\mu].
\].
\end{teorema}
\noindent Así la existencia de la esperanza condicional proviene de la derivada de Radon-Nikodym de la medida con signo definida por \(X\), para el álgebra \(\mathrm{F}\), es decir
\[
    \nu{\pm}(A)=\int_{A}X^{\pm}d\textbf{P}\hspace{0.5cm}\nu=\nu^{+}-\nu^{-},
\]
\noindent la cual es absolutamente continua con respecto a la medida de probabilidad \textbf{P}, entonces definimos \(Y=\frac{d\nu}{d\textbf{P}}[\textbf{P}]\), así simplemente verificamos que en efecto es una esperanza condicional. Por Radon-Nykodym, \(Y\) es medible, ahora

\begin{itemize}
\item \(\esp(|Y|)=\int_{\om}|Y|d\textbf{P}=\int_{\om}|X|d\textbf{P}<\infty\)
\item \(\esp(X1_A)=\int_{A}Xd\textbf{P}=\nu(A)=\int_{A}Yd\textbf{P}=\esp(Y1_A)\).
\end{itemize}

Algunas propiedades de la esperanza condicional son las siguientes:

\begin{itemize}
\item Linealidad: para todas \(a,b\in\re\) y \(X,Y\) \textbf{v.a} \(\esp(aX+bY|\mathrm{F})=a\esp(X|\mathrm{F})+b\esp(Y|\mathrm{F})\).
\item Monotonía: si \(X\geq0\), entonces \(\esp(Y|\mathrm{F})\geq 0\).
\item Si \(X\) es \(\mathrm{F}\) medible, entonces \(\esp(X|\mathrm{F})=X\).
\item Propiedad de Torre: Si \(\mathrm{G}\subset\mathrm{F}\subset\sig\), entonces:
\[
        \esp(\esp(X|\mathrm{F})|\mathrm{G})=\esp(\esp(X|\mathrm{G})|\mathrm{F})=\esp(X|\mathrm{G})
  \]
\end{itemize}

Más aún la esperanza condicional hereda las propiedades que son resultados comunes de la teoría de la integración, por ejemplo
\begin{itemize}
\item Convergencia monótona: Si \(\{X_n\}_{n\in\nat}\) es una sucesión de \textbf{v.as} no negativas que converge monótonamente \(X_N\uparrow X\), entonces \(\esp(X|\mathrm{F})=\lim\esp(X_n|\mathrm{F})\).
\item Convergencia dominada: Si \(\{X_n\}_{n\in\nat}\) es una sucesión de \textbf{v.as} convergente \(X_n\rightarrow X\), tal que las \textbf{v.as} sean integrables, no negativas y se encuentren dominadas por \(|X_n|\leq Y\) tal que \(\esp(Y|\mathrm{F})<\infty\),  entonces \(\esp(X|\mathrm{F})=\lim\esp(X_n|\mathrm{F})\).
\item Desigualdad de Jensen: Si \(f:\re\rightarrow\re\) es una función convexa (cóncava) y \(X\) es una variable aleatoria, entonces \(\esp(f(X)|\mathrm{F})\geq\esp(X|\mathrm{F})\) (resp \(\esp(f(X)|\mathrm{F})\leq\esp(X|\mathrm{F})\))
\end{itemize}
