Proba/Statistics and Data anaysis/estadistica.tex

\subsection{Distribuciones de probabilidad}
\label{sec:org9b9c610}
\noindent Consideremos \((\om,\sig,\prob)\) un espacio de probabilidad y sea \((E,S)\) un espacio medible y \(\xi:\om\rightarrow E\) una función medible, a esta función le llamremos \emph{elemento aleatorio} así existe una función \(\xi^{*}:S\rightarrow\sig\), definida como \(\xi^{*}(B)=\xi^{-1}(B)\), entonces es posible definir una medida de probabilidad en \((\xi^{*})^{-1}(\sig)\), definida por \(\prob\circ\xi^{*}(B)=\prob(\xi^{*}(B))\), a la medida \(\prob\circ\xi^{*}\), le llamaremos una \emph{distribución} de probabilidad y usualmente no distinguiremos entre una medida de probabilidad y una distribución incluso en la absencia de un elemento aleatorio.
\obs Cuando \(E=\re\) y \(S=B_{\re}\), un elemento aleatorio es una variable aleatoria y cuando \(E=\re^{d}\) y \(S=B_{\re^{d}}\) un elemento aleatorio se le conoce como \emph{vector aleatorio}.
\begin{def.}{Función de una distribución}
Dado un espacio de probabilidad \((\om,\sig,\prob)\) y un elemento medible \(\xi:\om\rightarrow E\), definimos la \textit{función} de distribución como la función \(F_{\xi}:\re\rightarrow[0,1]\)
\[
    F_{\xi}(\alpha)=\prob\circ\xi^{*}(-\infty,\alpha]=\prob(\xi\leq\alpha)
\]
\end{def.}
\noindent \textbf{Algunas propidades:} Supongamos que \(F\) es la función de distribución asociada a una variable aleatoria \(X\), entonces.
\begin{enumerate}
\item \(F:\re\rightarrow[0,1]\) es no decreciente, es decir \(F(x)\leq F(y)\) siempre que \(x\leq y\).
\item \(\lim_{x\rightarrow\infty}F(x)=1\) y \(\lim_{x\rightarrow -\infty}F(x)=0\).
\item \(F\) es continua por la derecha.
\end{enumerate}
\dem La demostración de estos hechos es evidente, el único que no es inmediatemente obvio es el punto número tres, para esto notamos que si tenemos la susesión \(\{x+1/n\}\), entonces por convergencia monónona tenemos que
\[
    \lim_{n\rightarrow\infty}\prob\Big(X\leq x+\frac{1}{n}\Big)=\prob\Big(X\leq x\Big)
\]
\noindent \textbf{Existencia:} Ahora supongamos que \(F\) es una función que cumple las propiedades 1.,2. y 3., entonces similar a la existencia de Lebesgue, es posible construir una medida \(\nu:\mathbb{B}_{\re}\rightarrow\re^{+}\) tal que \(\nu((-\infty,x])=F(x)\). A la medida \(\nu\) se le conoce como la medida de Lebesgue-Stieltjes de \(F\).
\eje \textbf{(La representación de Skorokhod de una variable aleatoria con una función de distribución prescrita en el intervalo [0,1])}\\[0pt]
Supongamos que \(F:\re\rightarrow[0,1]\) cumple con las propiedades 1.,2. y 3., como antes, entonces construimos una variable aleatoria en \(([0,1],\mathbb{B}[0,1],\lambda)\), donde \(\lambda\) es la medida de Lebesgue. Definimos
\begin{align*}
    X^{+}(\omega):=\inf\{\,z\,\vert\,F(z)>\omega\}=\sup\{\,y\,\vert\,F(y)\leq\omega\}\\
    X^{-}(\omega):=\inf\{\,z\,\vert\,F(z)\geq\omega\}=\sup\{\,y\,\vert\,F(y)<\omega\}.
\end{align*}
Observemos que por definición de \(X^{-}\), si \(\omega\leq F(c)\), entonces \(X^{-}(\omega)\leq c\). Ahora, si \(z>X^{-}(\omega)\), entonces \(F(z)\geq\omega\), entonces por continuidad a la derecha de \(F\), \(F(X^{-}(\omega))\geq\omega\) y por lo tanto
\[
     X^{-}(\omega)\leq c \implies \omega\leq F(X^{-}(\omega))\leq F(c)
\]
Por lo tanto tenemos que \(\{\,\omega\,\vert\,X^{-}(\omega)\leq c\}=\{\,\omega\,\vert\,\omega\leq F(c)\}\) lo que implica que
\[
    \prob(X\leq c)=\prob(\omega\leq F(c))=\int_{-\infty}^c F(x)\,dx=F(c)
\]
\qed
\obs \(X^{+}\) tiene la mimsa función de distribución ya que
\[
$\prob(X^{-} = X^{+})=1$.
\]
\eje \textbf{(Distribuciones binomiales)}
