Proba/Statistics and Data anaysis/estadistica.tex
\section{Independencia}
\label{sec:org57da789}
\noindent Nos enfocaremos en indepencenia de \(\sigma\) álgebras y describimos a partir de este la noción usual de independencia.
\begin{def.}{Independencia}
Sea \((\om,\sig,\prob)\) un espacio de probabilidad, decimos que una familia de sub \(\sigma\) álgebras \(\{\mathrm{F}_i\}_{i\in I}\) son \emph{independientes} si para cualquier \(\{i_1,\dots,i_n\}\subset I\) subconjunto fininto, se tiene que
\begin{equation}\label{indepen}
    \prob(A_{i_1}\cap\dots\cap A_{i_n})=\prod_{j=1}^n\prob(A_{i_j})\hspace{0.2cm}A_{i_j}\in\mathrm{F}_{i_j}.
\end{equation}
Similarmente a los eventos que cumplan con la ecuación \ref{indepen}, les llamaremos eventos \emph{independientes}.
\end{def.}
\begin{def.}{Variables aleatorias independientes.}
Decimos que las variables aleatorias \(\{X_i\}_{i\in I}\) en un espacio de probabilidad \((\om,\sig,\prob)\) son \emph{independientes} si \[\{\sigma(X_i)\}_{i\in I}\] son independientes. Se denotará la relación de independencia entre \(X\) e \(Y\) como \(X\upvDash Y\) y no distinguiremos entre variables aleatorias y \(\sigma\) álgebras, e incluso denotaremos \(X\upvDash\mathrm{F}\) cuando una variable aleatoria sea indepeniente de una sub \(\sigma\) álgebra.
\end{def.}
En términos de de \emph{eventos independientes} como sabemos la ecuación que se cumple es
\[
    \prob(A_{i_1}\cap\dots\cap A_{i_n})=\prod_{j=1}^n\prob(A_{i_j}),
\]
\noindent queremos generalizar este tipo de ecuaciones pero en el sentido de \(\pi\) sistemas en lugar de en nuestro sentido original de \(\sigma\) álgebras ya que estas son más complicadas de usar. Por lo que el siguiente lema es muy útil para este tipo de cuestiones
\begin{lema}
Sean $\mathrm{G}$ y $\mathrm{H}$ sub sigma álgebras de $\sig$ y sean $I$ y $J$ $\pi$ sistemas tales que
\[
    \sigma(I)=\mathrm{G},\quad\sigma(J)=\mathrm{H}.
\]
Entonces $\mathrm{G}$ y $\mathrm{H}$ son independientes si y solo si
\[
    \prob(A\cap B)=\prob(A)\prob(B)\quad A\in J,\,B\in J
\]
\end{lema}
\dem
Es claro que si las \(\sigma\) álgebra son independientes entonces los \(\pi\) sistemas son independientes. Por lo que sólo es necesario demostrar que si los \(\pi\) sistemas son independientes entonces las \(\sigma\) álgebras lo son, entonces dadas \(A\in I\) y \(B\in J\) fijos, definimos las siguientes medidas finitas
\[
    C\mapsto\prob(A\cap C)\quad C\mapsto\prob(B)\prob(C).
\]
\noindent Como ambas medidascoinciden en \(I\) y \(J\), por el lema de clases monótonas coincide en \(\sigma(I)=\mathrm{G}\) y \(\sigma(J)=\mathrm{H}\) y por lo tanto el lema es válido.
\qed\\[0pt]
\begin{cor}
Ahora si $X$ e $Y$ son variables aleatorias en un espacio de probabilidad $(\om,\sig,\prob)$ tales que para todo $\{x,y\}\subset\re$ se cumple
\[
    \prob(\{X\leq x\}\cap\{Y\leq y\}):=\prob(X\leq x\,,\, Y\leq y)=\prob(X\leq x)\prob(Y\leq y)
\]
entonces $X$ e $Y$ son variables aleatorias independientes
\end{cor}
\dem
Esto es claro de la proposición anterior debido a que la familia de conjuntos \(\{X^{-1}(-\infty,x]\,\vert\,x\in\re\}\) es un \(\pi\) sistema para \(\sigma(X)\) para toda \textbf{v.a} \(X\), así del lema anterior se sigue el resultado.
\qed\\[0pt]
\obs En términos de la esperanza conicional, si \(X \upvDash\mathrm{F}\), entonces \(\esp(X|\mathrm{F})=\esp(X)\), además \(Y=\esp(X)\) es \(\mathrm{F}\) medible pues
\[
    \forall A\in\mathrm{F}\hspace{0.3cm}\esp(X1_A)=\esp(X)\prob(A)=Y\esp(1_A)=\esp(Y1_A)
\]
\begin{prop}
Sea $(\om,\sig,\prob)$ espacio de probabilidad, $\mathrm{F}\subset\sig$ sub $\sigma$ álgebra y $X,Y$ \texrbf{v.a.} tal que $X$ sea $\mathrm{F}$ medible, entonces para toda $\varphi:\re\times\re\rightarrow\re$ Borel medible, se cumple
\[
\esp(\varphi(X,Y)|\mathrm{F})=\int_{y\in\re}\varphi(X,y)\prob_Y(dy)=\esp(\varphi(x,Y))|_{x\in\re}
\]
\end{prop}
\begin{lema}[Borel-Cantelli]\label{bor-can}
Sea $\{E_n\}$ una sucesión de eventos indpendientes en un espacio de probabilidad $(\om,\sig,\prob)$, entonces si
\begin{equation}
\sum_{n=1}^{\infty}\prob(E_n)=\infty\quad\text{implica}\quad\prob(\{E_n,\,\text{i.o }\})=\prob(\,\limsup E_n\,)
\end{equation}
\end{lema}
\dem Primero, sabemos que se cumple
\[
    \om\setminus(\limsup E_n)=\liminf \{\om\setminus E_n\}=\bigcup_{m\in\nat}\bigcap_{n\geq m}(\om\setminus E_n).
\]
\noindent Ahora si \(p_n=\prob(E_n)\), entonces por independencia se cumple que
\[
    \prob\Big(\bigcap_{n\geq m}(\om\setminus E_n)\Big)=\prod_{n\geq m}(1-p_n).
\]
Por monotonía de ambos lados de la ecuación, al tomar el límite cuando \(r\uparrow\infty\) y la condición \(\{r\geq n\geq m\}\), obtenemos gracias a la independencia lo siguiente. Para cada \(x\geq 0\), \(1-x\leq\exp(-x)\), así como la serie de los \(p_n\) es divergente por hipótesis, entonces
\[
    \prod(1-p_n)\leq\esp\Big(-\sum_{n\geq m}p_n\Big)=0.
\]
\noindent Por lo que \(\prob(\{\om\setminus\limsup E_n\})=0\) \qed
\eje
\end{document}